In [1]:
import numpy as np
import pandas as pd

ImportError: cannot import name 'dragon4_positional'

In [22]:
## Series ----------------------------------------------------------

In [9]:
labels = ['a','b','c']

In [10]:
minha_lista = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [11]:
pd.Series(data=minha_lista, index=labels)

a    10
b    20
c    30
dtype: int64

In [12]:
series = pd.Series(data=minha_lista, index=labels)

In [13]:
 series['b']

20

In [14]:
series = pd.Series(minha_lista, labels)

In [15]:
series = pd.Series(arr, labels)

In [16]:
ser1 = pd.Series([1,2,3,4],['EUA','Alemanha','URSS','Japão'])

In [17]:
ser1

EUA         1
Alemanha    2
URSS        3
Japão       4
dtype: int64

In [18]:
ser2 = pd.Series([1,2,3,4],['EUA','Alemanha','Itália','Japão'])

In [19]:
ser2

EUA         1
Alemanha    2
Itália      3
Japão       4
dtype: int64

In [20]:
ser1+ser2

Alemanha    4.0
EUA         2.0
Itália      NaN
Japão       8.0
URSS        NaN
dtype: float64

In [24]:
## DATA FRAME(CONJUNTO DE SERIES) ---------------------CRIAÇÃO E FATIAMENTO--------------------

In [25]:
np.random.seed(101) ## numeros aleatorios serão iguais em qualquer computador

In [29]:
df = pd.DataFrame(np.random.randn(5,4),'A B C D E'.split(),'W X Y Z'.split()) ## dados aleatorios de uma distribuiçaõ normal
## linhas, e colunas

In [30]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [31]:
df['W']

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

In [33]:
df[['W','Z']]

          W         Z
A -0.993263  0.000366
B  1.025984  0.649826
C  2.154846 -0.346419
D  0.147027  1.024810
E -0.925874  0.610478

In [34]:
df['Q'] = df['W']+df['X']##criando nova coluna

In [35]:
df

          W         X         Y         Z         Q
A -0.993263  0.196800 -1.136645  0.000366 -0.796464
B  1.025984 -0.156598 -0.031579  0.649826  0.869386
C  2.154846 -0.610259 -0.755325 -0.346419  1.544588
D  0.147027 -0.479448  0.558769  1.024810 -0.332421
E -0.925874  1.862864 -1.133817  0.610478  0.936990

In [36]:
df.drop('Q',axis=1,inplace=True)##Depetando toda coluna Q(axis =1), e já alterando diretamente no DataFrame (inplace=true)

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [41]:
df.loc['A','W']## Localização por index

-0.99326349997336605

In [39]:
df.loc[['A','B'],['W','Z']]

          W         Z
A -0.993263  0.000366
B  1.025984  0.649826

In [58]:
df.iloc[1:-1,2:] ## as linhas e colunas sao utilizados numeros para pesquisa.

          Y         Z
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057

In [42]:
## Seleção condicional, set_index

In [44]:
from numpy.random import randn

In [45]:
np.random.seed(101)

In [46]:
df = pd.DataFrame(np.random.randn(5,4),'A B C D E'.split(),'W X Y Z'.split()) ## dados aleatorios de uma distribuiçaõ normal
## linhas, e colunas

In [47]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [48]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [49]:
bol = df > 0

In [50]:
df[bol]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [51]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [53]:
df[df['W']>0]['Y'] ##Retornar os valores maior que zero da coluna W, mas mostra a coluna Y

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [54]:
df[(df['W']>0) & ((df['W']>0.6))] ##Quando for trazer os valor em séries utilizar & ou |

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [59]:
## RESETAR O INDEX

In [64]:
df.reset_index() ##implace=True;

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [65]:
col = 'RS RJ SP AM SC'.split();

In [66]:
col

['RS', 'RJ', 'SP', 'AM', 'SC']

In [67]:
df['UF'] = col;

In [78]:
df

           W         X         Y         Z
UF
RS  2.706850  0.628133  0.907969  0.503826
RJ  0.651118 -0.319318 -0.848077  0.605965
SP -2.018168  0.740122  0.528813 -0.589001
AM  0.188695 -0.758872 -0.933237  0.955057
SC  0.190794  1.978757  2.605967  0.683509

In [82]:
df.reset_index(inplace=True) ##implace=True;

In [83]:
df

   UF         W         X         Y         Z
0  RS  2.706850  0.628133  0.907969  0.503826
1  RJ  0.651118 -0.319318 -0.848077  0.605965
2  SP -2.018168  0.740122  0.528813 -0.589001
3  AM  0.188695 -0.758872 -0.933237  0.955057
4  SC  0.190794  1.978757  2.605967  0.683509

In [86]:
df.set_index('UF',inplace=True)

In [87]:
df

           W         X         Y         Z
UF
RS  2.706850  0.628133  0.907969  0.503826
RJ  0.651118 -0.319318 -0.848077  0.605965
SP -2.018168  0.740122  0.528813 -0.589001
AM  0.188695 -0.758872 -0.933237  0.955057
SC  0.190794  1.978757  2.605967  0.683509

In [88]:
## INDICES MULTINIVEL

In [90]:
# Níveis de Índice
outside = ['G1','G1','G1','G2','G2','G2'] ##lISTAS
inside = [1,2,3,1,2,3] ##LISTAS
hier_index = list(zip(outside,inside)) ## Lista de tuplas, [(outsid,inside),(outsid,inside),(outsid,inside),...(outsid,inside)]
hier_index = pd.MultiIndex.from_tuples(hier_index) ## indice multinivel

In [91]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [95]:
df = pd.DataFrame(np.random.randn(6,2),hier_index,'A B'.split())

In [96]:
df

             A         B
G1 1  1.025984 -0.156598
   2 -0.031579  0.649826
   3  2.154846 -0.610259
G2 1 -0.755325 -0.346419
   2  0.147027 -0.479448
   3  0.558769  1.024810

In [98]:
df.loc['G1'] ## LOC busca as linhas

          A         B
1  1.025984 -0.156598
2 -0.031579  0.649826
3  2.154846 -0.610259

In [99]:
df.loc['G1'].loc[1] ##busca Nivel e linhas

A    1.025984
B   -0.156598
Name: 1, dtype: float64

In [100]:
df.loc['G1']['B'] ##Busca Nivel e Coluna

1   -0.156598
2    0.649826
3   -0.610259
Name: B, dtype: float64

In [102]:
df.index.names ##nome dos niveis

FrozenList([None, None])

In [103]:
df.index.names = ['Grupo','Numero'] ##nome dos niveis

In [104]:
df

                     A         B
Grupo Numero
G1    1       1.025984 -0.156598
      2      -0.031579  0.649826
      3       2.154846 -0.610259
G2    1      -0.755325 -0.346419
      2       0.147027 -0.479448
      3       0.558769  1.024810

In [105]:
df.xs(['G1'])

               A         B
Numero
1       1.025984 -0.156598
2      -0.031579  0.649826
3       2.154846 -0.610259

In [107]:
df.xs(1, level='Numero') ##BUSCA OS VALORES DA LINHA, SEM PRECISAR BUSCAR OS NIVEIS

              A         B
Grupo
G1     1.025984 -0.156598
G2    -0.755325 -0.346419

In [108]:
## Tratamento de dados ausentes

In [113]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [114]:
df= pd.DataFrame(d);
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [115]:
df.dropna() ## exclui os NaN e tambem os valores das linhas que etem dados faltante, mas se colcoasse eixo=1 seria as colunas.
## se colocar tHresh =2 df.dropna(tHresh =2), exclui as linhas que tiverem mais que dois NaN

ValueError: Need to specify at least one of 'labels', 'index' or 'columns'

In [118]:
df.fillna(value = 'X')

   A  B  C
0  1  5  1
1  2  X  2
2  X  X  3

In [120]:
df['A'].fillna(value = df['A'].mean()) ## fillna subistitui os NAN por alguma coisa, no caso do exemplo a média da coluna 9

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [122]:
df.fillna(method='ffill') ## prreche os dados com os dados anterior, exemplo em casos temporall

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

In [123]:
## GROUP BY

In [124]:
import pandas as pd
# Dicionario
data = {'Empresa':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Nome':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Venda':[200,120,340,124,243,350]}

In [125]:
data

{'Empresa': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Nome': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Venda': [200, 120, 340, 124, 243, 350]}

In [126]:
df=pd.DataFrame(data)

In [127]:
df

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [128]:
groupby = df.groupby('Empresa')

In [129]:
groupby.sum()

         Venda
Empresa
FB         593
GOOG       320
MSFT       464

In [130]:
groupby.describe()

        Venda
        count   mean         std    min     25%    50%     75%    max
Empresa
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [131]:
groupby.describe().loc['GOOG']

Venda  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [132]:
## Concatenar, Juntar e Mesclar

In [135]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [136]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [137]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [138]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [139]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [140]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [145]:
esquerda = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
direita = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [149]:
pd.merge(esquerda,direita,how='inner',on='key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [150]:
esquerda = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
direita = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [151]:
pd.merge(esquerda,direita,how='inner',on=['key1','key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2

In [152]:
pd.merge(esquerda,direita,how='outer',on=['key1','key2'])

     A    B key1 key2    C    D
0   A0   B0   K0   K0   C0   D0
1   A1   B1   K0   K1  NaN  NaN
2   A2   B2   K1   K0   C1   D1
3   A2   B2   K1   K0   C2   D2
4   A3   B3   K2   K1  NaN  NaN
5  NaN  NaN   K2   K0   C3   D3

In [153]:
esquerda = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

direita = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [155]:
esquerda.join(direita)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [156]:
esquerda.join(direita,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [157]:
## OPERAÇÕES

In [161]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [162]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [163]:
len(df)

4

In [164]:
df.nunique()

col1    4
col2    3
col3    4
dtype: int64

In [165]:
df['col2'].nunique()

3

In [166]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [172]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [173]:
def quadrado(valor):
    return valor **2

In [176]:
df['col1'].apply(quadrado)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [177]:
df['col3'].apply(len) ## Tamanho das strings

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [179]:
df['col1'].apply(lambda x: x**2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [181]:
del df['col2']

In [182]:
df

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [183]:
df.columns

Index(['col1', 'col3'], dtype='object')

In [184]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [185]:
df.sort_values(by='col1')

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [186]:
df.isnull()

    col1   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [187]:
df.dropna()

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [188]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [191]:
df['col1'].fillna(df['col1'].mean())

0    1.0
1    2.0
2    3.0
3    2.0
Name: col1, dtype: float64

In [195]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df.head()

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4

In [196]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN